[
  {
    "image": "image_url_1.jpg",
    "estate_title": "Tranquil Lakeside Retreat",
    "estate_shot_description": "Peaceful single-family home with stunning lake views",
    "id": "001",
    "segment_name": "Single-family homes",
    "full_description": "Escape the hustle and bustle of city life and embrace the tranquility of lakeside living in this breathtaking single-family home. Situated on the shores of a pristine lake, this property offers unparalleled serenity and natural beauty. The spacious interior features an open-concept layout with large windows that flood the space with natural light and offer stunning views of the surrounding landscape. The gourmet kitchen is a chef's dream, equipped with high-end appliances, granite countertops, and a large island for meal preparation and casual dining. The expansive living room is perfect for entertaining guests or simply relaxing with loved ones, while the cozy fireplace adds warmth and ambiance on chilly evenings. Upstairs, the luxurious master suite boasts panoramic lake views, a spa-like ensuite bathroom, and a private balcony where you can savor your morning coffee while watching the sunrise over the water. Three additional bedrooms provide ample space for family and guests, and the home office is ideal for remote work or study. Outside, the expansive deck is perfect for al fresco dining and entertaining, and the private dock offers direct access to the lake for swimming, boating, and fishing. With its idyllic setting, luxurious amenities, and unmatched beauty, this lakeside retreat is truly a dream home come true.",
    "price": "$1,200,000",
    "status": "sale",
    "area": "3500 sq ft",
    "location": "Lakefront Community, USA",
    "facilities": ["living room", "kitchen", "private dock"],
    "rating": 4.9,
    "year_built": 2015,
    "last_remodel_year": 2020,
    "features": [
      "Panoramic lake views",
      "Gourmet kitchen",
      "Master suite with balcony",
      "Fireplace",
      "Home office",
      "Expansive deck",
      "Private dock",
      "High-end appliances",
      "Granite countertops",
      "Hardwood floors",
      "Walk-in closets",
      "Three-car garage"
    ]
  },
  {
    "image": "image_url_2.jpg",
    "estate_title": "Urban Townhouse Living",
    "estate_shot_description": "Modern townhouse in the heart of the city",
    "id": "002",
    "segment_name": "Townhouses",
    "full_description": "Experience the best of urban living in this stylish and contemporary townhouse located in the heart of the city. Boasting sleek design, modern amenities, and convenient access to all that the city has to offer, this townhouse is perfect for those seeking a vibrant and dynamic lifestyle. The spacious open-concept living area is flooded with natural light, creating a warm and inviting atmosphere for relaxation and entertaining. The gourmet kitchen is a chef's delight, featuring stainless steel appliances, quartz countertops, and ample cabinet space for storage. Upstairs, the luxurious master suite offers a peaceful retreat from the hustle and bustle of city life, complete with a spa-like ensuite bathroom and private balcony overlooking the urban landscape. Two additional bedrooms provide plenty of space for family and guests, while the rooftop terrace offers stunning views of the city skyline and is ideal for outdoor gatherings and al fresco dining. With its prime location, modern amenities, and sophisticated design, this townhouse offers the ultimate urban lifestyle.",
    "price": "$900,000",
    "status": "sale",
    "area": "2400 sq ft",
    "location": "Downtown Metropolis, USA",
    "facilities": ["living room", "rooftop terrace"],
    "rating": 4.8,
    "year_built": 2017,
    "last_remodel_year": null,
    "features": [
      "Open-concept layout",
      "Gourmet kitchen",
      "Master suite with balcony",
      "Rooftop terrace",
      "Hardwood floors",
      "Quartz countertops",
      "Stainless steel appliances",
      "Walk-in closets",
      "Two-car garage",
      "Smart home technology",
      "City views",
      "Convenient location"
    ]
  },
  {
    "image": "image_url_3.jpg",
    "estate_title": "Luxury High-Rise Apartment",
    "estate_shot_description": "Sleek and modern apartment with breathtaking city views",
    "id": "003",
    "segment_name": "Apartments",
    "full_description": "Indulge in luxury living in this stunning high-rise apartment situated in the heart of the city. Boasting panoramic views of the skyline, top-of-the-line amenities, and sophisticated design, this apartment offers the ultimate urban lifestyle. The spacious and light-filled living area features floor-to-ceiling windows that provide sweeping views of the city below, creating an ambiance of modern elegance and luxury. The state-of-the-art kitchen is equipped with high-end appliances, sleek cabinetry, and quartz countertops, making it perfect for both cooking and entertaining. The lavish master suite offers a private sanctuary from the hustle and bustle of city life, complete with a spa-like ensuite bathroom and walk-in closet. Additional highlights include a private balcony, perfect for enjoying morning coffee or evening cocktails while taking in the breathtaking views, as well as access to a range of amenities such as a fitness center, pool, and concierge services. With its unbeatable location, luxurious amenities, and stunning views, this high-rise apartment is the epitome of urban sophistication.",
    "price": "$4,500/month",
    "status": "rent",
    "area": "1500 sq ft",
    "location": "City Center, USA",
    "facilities": ["living room", "balcony", "pool"],
    "rating": 4.9,
    "year_built": 2019,
    "last_remodel_year": null,
    "features": [
      "Panoramic city views",
      "Floor-to-ceiling windows",
      "Gourmet kitchen",
      "Master suite with ensuite bathroom",
      "Walk-in closet",
      "Private balcony",
      "High-end appliances",
      "Quartz countertops",
      "Hardwood floors",
      "Fitness center",
      "Swimming pool",
      "Concierge services"
    ]
  },
  {
    "image": "image_url_4.jpg",
    "estate_title": "Student Housing Complex",
    "estate_shot_description": "Modern student apartments near campus",
    "id": "004",
    "segment_name": "Student Housing",
    "full_description": "Experience the best of student living in this modern and stylish student housing complex located just steps away from campus. Offering a range of fully furnished apartments and state-of-the-art amenities, this complex provides everything you need for a comfortable and convenient college experience. Each apartment features a spacious layout with modern furnishings, a fully equipped kitchen, and a private bathroom, ensuring that you have everything you need to feel at home. The complex also offers a variety of amenities to help you make the most of your college years, including a fitness center, study lounges, and outdoor recreational areas. Plus, with on-site management and 24-hour maintenance, you can rest easy knowing that help is always just a phone call away. With its unbeatable location, modern amenities, and comfortable living spaces, this student housing complex is the perfect place to call home during your college years.",
    "price": "$800/month",
    "status": "rent",
    "area": "600 sq ft",
    "location": "College Town, USA",
    "facilities": ["living room", "gym", "study lounge"],
    "rating": 4.7,
    "year_built": 2016,
    "last_remodel_year": null,
    "features": [
      "Fully furnished",
      "Fully equipped kitchen",
      "Private bathroom",
      "On-site laundry",
      "Fitness center",
      "Study lounges",
      "Outdoor recreational areas",
      "On-site management",
      "24-hour maintenance",
      "Close to campus",
      "Secure access",
      "High-speed internet"
    ]
  },
  {
    "image": "image_url_5.jpg",
    "estate_title": "Senior Living Community",
    "estate_shot_description": "Comfortable and caring senior living residence",
    "id": "005",
    "segment_name": "Senior Living Communities",
    "full_description": "Discover a welcoming and supportive senior living community where you can enjoy your golden years to the fullest. Our thoughtfully designed residences offer a range of services and amenities tailored to meet the unique needs of older adults. From delicious chef-prepared meals to engaging social activities and wellness programs, there's always something to do and someone to meet. Our caring staff is available around the clock to provide assistance with activities of daily living and medication management, ensuring that you can maintain your independence while receiving the support you need. Whether you're looking for independent living, assisted living, or memory care, our community offers a range of living options to suit your lifestyle and preferences. Plus, with a convenient location close to shopping, dining, and medical facilities, everything you need is right at your fingertips. Come experience the warmth and camaraderie of our senior living community and discover why so many older adults are proud to call it home.",
    "price": "$3,000/month",
    "status": "rent",
    "area": "1800 sq ft",
    "location": "Senior Community, USA",
    "facilities": ["living room", "dining hall", "wellness center"],
    "rating": 4.6,
    "year_built": 2000,
    "last_remodel_year": 2018,
    "features": [
      "Chef-prepared meals",
      "Social activities",
      "Wellness programs",
      "Around-the-clock staff",
      "Assistance with activities of daily living",
      "Medication management",
      "Independent living",
      "Assisted living",
      "Memory care",
      "Convenient location",
      "Spacious floor plans",
      "Beautifully landscaped grounds"
    ]
  },
  {
    "image": "image_url_6.jpg",
    "estate_title": "Luxury Vacation Villa",
    "estate_shot_description": "Exquisite villa with private pool and ocean views",
    "id": "006",
    "segment_name": "Vacation Rentals",
    "full_description": "Experience the ultimate luxury getaway in this stunning vacation villa located in a tropical paradise. Nestled on a hillside overlooking the sparkling ocean, this exquisite property offers unparalleled privacy, comfort, and breathtaking views. The spacious interior features elegant furnishings, high-end finishes, and modern amenities, creating a luxurious retreat for relaxation and entertainment. The gourmet kitchen is a chef's dream, equipped with top-of-the-line appliances, granite countertops, and a large island for meal preparation. The expansive living area is perfect for gathering with family and friends, while the outdoor terrace offers alfresco dining and lounging areas where you can soak up the sun and savor the ocean breeze. Cool off in your private infinity pool or unwind in the adjacent jacuzzi while enjoying panoramic views of the coastline. With four beautifully appointed bedrooms, including a lavish master suite with a spa-like ensuite bathroom and private balcony, this villa offers ample space for up to eight guests to enjoy a truly unforgettable vacation experience. Whether you're seeking adventure or relaxation, this luxury vacation villa is the perfect destination for your next tropical getaway.",
    "price": "$5,000/week",
    "status": "rent",
    "area": "4000 sq ft",
    "location": "Tropical Paradise, USA",
    "facilities": ["living room", "private pool", "jacuzzi"],
    "rating": 4.9,
    "year_built": 2014,
    "last_remodel_year": 2019,
    "features": [
      "Ocean views",
      "Gourmet kitchen",
      "Infinity pool",
      "Jacuzzi",
      "Outdoor terrace",
      "Alfresco dining area",
      "Luxurious master suite",
      "Spa-like ensuite bathroom",
      "Private balcony",
      "High-end appliances",
      "Granite countertops",
      "Open-concept layout"
    ]
  },
  {
    "image": "image_url_7.jpg",
    "estate_title": "Downtown Loft Apartment",
    "estate_shot_description": "Chic loft apartment in the heart of downtown",
    "id": "007",
    "segment_name": "Apartments",
    "full_description": "Live in style in this chic loft apartment located in the vibrant heart of downtown. Housed in a historic building, this beautifully renovated apartment seamlessly blends modern luxury with industrial charm. The open-concept layout features soaring ceilings, exposed brick walls, and hardwood floors, creating a trendy urban aesthetic that's perfect for contemporary living. The gourmet kitchen boasts stainless steel appliances, quartz countertops, and a large island with seating for casual dining and entertaining. The spacious living area offers plenty of room to relax and unwind, while the lofted bedroom provides a private retreat from the hustle and bustle of the city below. With its unbeatable location, stylish design, and top-notch amenities, this downtown loft apartment offers the ultimate urban living experience.",
    "price": "$2,500/month",
    "status": "rent",
    "area": "1000 sq ft",
    "location": "Downtown District, USA",
    "facilities": ["living room", "gourmet kitchen"],
    "rating": 4.7,
    "year_built": 1920,
    "last_remodel_year": 2018,
    "features": [
      "Exposed brick walls",
      "Soaring ceilings",
      "Hardwood floors",
      "Gourmet kitchen",
      "Stainless steel appliances",
      "Quartz countertops",
      "Large island",
      "Lofted bedroom",
      "Historic building",
      "Central location",
      "Close to restaurants and shops",
      "Pet-friendly"
    ]
  },
  {
    "image": "image_url_8.jpg",
    "estate_title": "Beachfront Bungalow",
    "estate_shot_description": "Quaint bungalow steps away from the beach",
    "id": "008",
    "segment_name": "Vacation Rentals",
    "full_description": "Escape to paradise in this charming beachfront bungalow located just steps away from the sand and surf. Nestled in a secluded tropical garden, this quaint retreat offers the perfect blend of relaxation and adventure. The cozy interior features nautical-inspired decor, comfortable furnishings, and all the amenities you need for a memorable beach getaway. The fully equipped kitchen allows you to prepare delicious meals with fresh local ingredients, which you can enjoy in the sunny dining area or al fresco on the shaded patio. After a day of sun and sea, retreat to the comfortable bedroom for a restful night's sleep. Wake up to the sound of waves crashing and enjoy your morning coffee on the private deck while taking in breathtaking ocean views. With its prime beachfront location, tranquil surroundings, and laid-back atmosphere, this beachfront bungalow is the perfect destination for your next vacation.",
    "price": "$300/night",
    "status": "rent",
    "area": "800 sq ft",
    "location": "Beachfront Paradise, USA",
    "facilities": ["living room", "kitchen", "private deck"],
    "rating": 4.8,
    "year_built": 1965,
    "last_remodel_year": 2015,
    "features": [
      "Beachfront location",
      "Nautical-inspired decor",
      "Fully equipped kitchen",
      "Outdoor dining area",
      "Private deck",
      "Ocean views",
      "Comfortable bedroom",
      "Secluded tropical garden",
      "Shaded patio",
      "WiFi",
      "BBQ grill",
      "Outdoor shower"
    ]
  },
  {
    "image": "image_url_9.jpg",
    "estate_title": "Mountain Cabin Retreat",
    "estate_shot_description": "Cozy cabin nestled in the mountains",
    "id": "009",
    "segment_name": "Vacation Rentals",
    "full_description": "Experience the beauty of the great outdoors in this charming mountain cabin retreat. Tucked away in a secluded forest setting, this cozy cabin offers the perfect escape from the hustle and bustle of everyday life. The rustic interior features exposed wood beams, a stone fireplace, and comfortable furnishings, creating a warm and inviting atmosphere for relaxation and rejuvenation. The fully equipped kitchen allows you to prepare hearty meals to enjoy with family and friends, while the spacious living area is ideal for cozying up with a good book or gathering around the fire for game night. Step outside to breathe in the fresh mountain air and take in the scenic views from the private deck, where you can relax in the hot tub or dine alfresco under the stars. With its serene location, comfortable accommodations, and access to outdoor recreation, this mountain cabin retreat is the perfect destination for your next getaway.",
    "price": "$200/night",
    "status": "rent",
    "area": "1200 sq ft",
    "location": "Mountain Wilderness, USA",
    "facilities": ["living room", "kitchen", "hot tub"],
    "rating": 4.7,
    "year_built": 1980,
    "last_remodel_year": 2010,
    "features": [
      "Secluded forest setting",
      "Exposed wood beams",
      "Stone fireplace",
      "Fully equipped kitchen",
      "Comfortable furnishings",
      "Private deck",
      "Hot tub",
      "Scenic views",
      "WiFi",
      "Board games",
      "Outdoor grill",
      "Hiking trails nearby"
    ]
  }
]
